---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.ConditionType
source: html/3935458b-08be-fa9b-a2f9-7350e2c3fe66.htm
---
# Autodesk.Revit.DB.Mechanical.Space.ConditionType Property

Get or set the Condition type of the Space.

## Syntax (C#)
```csharp
public ConditionType ConditionType { get; set; }
```

## Remarks
This property is used to get or set the Condition type of the Space.